In [1]:
#Lambda Function

sq=lambda x:x**2

In [2]:
sq(4)

16

In [3]:
si= lambda p,r,t:round((p*r*t)/100,2)

In [5]:
si(100,2,4)

8.0

In [6]:
sequence=[1,2,3,4,5,6]

In [13]:
for each in map(lambda x: x**2, sequence):
    print(each)

1
4
9
16
25
36

In [14]:
import pandas as pd

In [37]:
pf=pd.read_csv(r'C:\Users\vinayak.lakeshri\Documents\DetailsOfEmployees.csv')

In [38]:
print(pf)

     Fname   Lname  Height  Age   Mob
0     Yash  Saxena     6.1   33  8979
1      Sam   Malik     5.7   32  9997
2     Saif    Khan     5.6   34  9643
3  Ashwini   Guler     5.9   30  1234

In [39]:
pf

     Fname   Lname  Height  Age   Mob
0     Yash  Saxena     6.1   33  8979
1      Sam   Malik     5.7   32  9997
2     Saif    Khan     5.6   34  9643
3  Ashwini   Guler     5.9   30  1234

In [43]:
pf['ShortTail']=list(map(lambda x:"Short" if x<5.7 else "Tall", pf['Height']))

In [44]:
pf

     Fname   Lname  Height  Age   Mob ShortTail
0     Yash  Saxena     6.1   33  8979      Tall
1      Sam   Malik     5.7   32  9997      Tall
2     Saif    Khan     5.6   34  9643     Short
3  Ashwini   Guler     5.9   30  1234      Tall